# Date Consistency Checks

In [2]:
# import libraries
import pandas as pd
import numpy as np
import os

## Products.csv

### Import file

In [3]:
# load product.csv

path = r'/Users/patel/Documents/CF-Data Anaylst Course/Achievement-4/Instacart Basket Analysis-Oct 2023/02 Data/'
dtypes = {'aisle_id': 'int16', 'department_id': 'int8'}
df_prods = pd.read_csv(os.path.join(path, 'Orginal Data/4.3_orders_products/products.csv'), dtype=dtypes, index_col=False)

#convert product_id to string

df_prods['product_id'] = df_prods['product_id'].astype('str')

df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  object
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int16
 3   department_id  49693 non-null  int8
 4   prices         49693 non-null  float64
dtypes: float64(1), int16(1), int8(1), object(2)
memory usage: 1.3+ MB

### Missing Values

In [4]:
# find columns with missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

#### product_name -> 16 missing values ( 0.032%)

In [5]:
# find rows with missing product name

df_na_prod_name = df_prods[df_prods['product_name'].isnull() == True]
df_na_prod_name

      product_id product_name  aisle_id  department_id  prices
33            34          NaN       121             14    12.2
68            69          NaN        26              7    11.8
115          116          NaN        93              3    10.8
261          262          NaN       110             13    12.1
525          525          NaN       109             11     1.2
1511        1511          NaN        84             16    14.3
1780        1780          NaN       126             11    12.3
2240        2240          NaN        52              1    14.2
2586        2586          NaN       104             13    12.4
3159        3159          NaN       126             11    13.1
3230        3230          NaN       120             16    14.4
3736        3736          NaN        41              8    14.8
4283        4283          NaN        77              7    14.4
4790        4790          NaN        91             16    14.5
38187      38183          NaN        39             12    20.9
40444      40440          NaN       120             16    14.8

#### Create new dataframe without missing product name rows

In [6]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]
df_prods_clean.shape

(49677, 5)

### Find and Manage Duplicates

#### Find duplicates in prods_clean

In [7]:
#find list of duplicated rows based on all column values - 5 rows
df_dups = df_prods_clean[df_prods_clean.duplicated()]

df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

#### Remove duplicates from prods

In [8]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

In [9]:
df_dups2 = df_prods_clean_no_dups[df_prods_clean_no_dups.duplicated(subset=['product_id'], keep=False)]
df_dups2

,product_id,product_name,aisle_id,department_id,prices
6799,6800,Revive Zero Vitamin Water,64,7,6.4
6800,6800,Sprouted Quinoa Flakes Baby Cereal,92,18,14.0
26520,26520,Clinical Advanced Solid Ultimate Fresh Anti-Pe...,80,11,10.6
26521,26520,Cheese Shredded Sharp Cheddar Reduced Fat 2%,21,16,2.9

### Export Cleaned Products DF to CSV

In [10]:
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Prepared Data/products_checked.csv'))

## Wrangled Orders File

### Import wrangled orders file

In [11]:
# To reduce memory, cast data types while importing file into dataframe
dtypes = {'order_number': 'int8', 'order_dow': 'int8', 'order_hour_of_day': 'int8','days_since_prior_order': 'float32' }

df_ords = pd.read_csv(os.path.join(path, 'Prepared Data/orders_wrangled.csv'), dtype=dtypes, index_col=0)

df_ords['order_id'] = df_ords['order_id'].astype('str')
df_ords['user_id'] = df_ords['user_id'].astype('str')
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   number_of_orders        int64
 3   orders_days_of_week     int64
 4   order_hour_of_day       int8
 5   days_since_prior_order  float32
dtypes: float32(1), int64(2), int8(1), object(2)
memory usage: 146.8+ MB

### Check for irregularities

In [12]:
df_ords.describe()

,number_of_orders,orders_days_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111483e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.161989e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### Data Observations

days_since_prior order:
    1. Count of rows is less 206,209
    2. Max is 30 days. Is the data obtained for orders in last 30 days?

### Check of mixed data types

In [13]:
#code to check for columns that have mixed data type
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    
    if len (df_ords[weird]) > 0:
        print (col)

no mixed datype column found

### Check for Missing values

In [14]:
# find columns with missing values
df_ords.isnull().sum()

order_id                       0
user_id                        0
number_of_orders               0
orders_days_of_week            0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [15]:
# check missing values in days_since_prior_order

df_days_since_missing = df_ords[df_ords['days_since_prior_order'].isnull()]
df_days_since_missing.value_counts('number_of_orders')

number_of_orders
1    206209
Name: count, dtype: int64

#### 206,209 values missing in days_since_prior_order column

In [16]:
# displaying rows with missing days_since_prior_order
df_days_since_missing

,order_id,user_id,number_of_orders,orders_days_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [17]:
# Double check if any data with 1 'number of orders' and days_since_prior_order is not null
df_ords[(df_ords['number_of_orders']==1) & (df_ords['days_since_prior_order'].isnull()==False)]

Empty DataFrame
Columns: [order_id, user_id, number_of_orders, orders_days_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [20]:
crosstab = pd.crosstab(df_ords['days_since_prior_order'], df_ords['number_of_orders'], dropna = False)

In [24]:
crosstab.to_clipboard()

#### Address missing values

All users (206,209) have their first order a missing 'days_since_prior_order' value. This makes sense since this is their first order recorded and so having any value days_since_prior_order wouldn't make sense

I have decided to leave the data as is and not impute values. The data can help recognise customers who have only made 1 order or new customers.

### Check & Address Duplicates

In [57]:
# create a subset of duplicate records and check shape
df_dups = df_ords[df_ords.duplicated()]
df_dups.shape

(0, 6)

Number of rows df_dups = 0. This shows there are no duplicates in orders dataset

### Export orders

In [58]:
df_ords.to_csv(os.path.join(path, 'Prepared Data/orders_checked.csv'))